"""
Дана строка, состоящая из слов, разделенных пробелами. Напишите программу,
которая подсчитывает количество слов в этой строке.
"""

stroka = input().split()
print(len(stroka))
